Revit 2026 API

# PartMakerMethodToDivideVolumesAreElementsValidIntersectingReferences(ICollectionElementId) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool AreElementsValidIntersectingReferences(
	ICollection<ElementId> elementIds
)
```
```vb
Public Function AreElementsValidIntersectingReferences (
	elementIds As ICollection(Of ElementId)
) As Boolean
```
```cpp
public:
bool AreElementsValidIntersectingReferences(
	ICollection<ElementId^>^ elementIds
)
```
```fsharp
member AreElementsValidIntersectingReferences :
        elementIds : ICollection<ElementId> -> bool
```

#### Parameters

elementIds ICollectionElementId

#### Return Value

Boolean

#### Reference

PartMakerMethodToDivideVolumes Class

AreElementsValidIntersectingReferences Overload

Autodesk.Revit.DB Namespace